# **Task 1: Data Analysis**

In [23]:
import pandas as pd
import numpy as np
import seaborn as sns

df = pd.read_csv('Temperature_change_Data.csv')

In [24]:
df.shape

(16756, 4)

In [25]:
df.head()

  Country Code    Country Name  year  tem_change
0          AFG     Afghanistan  1961      -0.080
1          ALB         Albania  1961       0.631
2          DZA         Algeria  1961       0.186
3          ASM  American Samoa  1961      -0.014
4          AND         Andorra  1961       0.749

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16756 entries, 0 to 16755
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Country Code  14042 non-null  object
 1   Country Name  16756 non-null  object
 2   year          16756 non-null  int64
 3   tem_change    14975 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 523.8+ KB

In [37]:
df.duplicated().any()

False

In [31]:
df.isna().sum()

Country Code    2714
Country Name       0
year               0
tem_change      1781
dtype: int64

There are more than one option to deal with nan values in this case (in tem_change):


*   Drop nan values.
*   Fill it with 0, It means that you consider there is no change.
*   Fill it with the mean of all countries temperature change.
*   Fill it with the mean of temperature change each country separately.

In [32]:
df.dropna(subset=['Country Code'], inplace=True)
df.fillna(0, inplace=True)
print(df.isna().sum())

Country Code    0
Country Name    0
year            0
tem_change      0
dtype: int64

**Top countries for the last 10 years.**

In [33]:
top_10 = df[df['year']>=df['year'].max()-10].groupby('Country Name').sum().sort_values(by='tem_change', ascending=False)[:10].reset_index()['Country Name']
print(top_10)

0    Svalbard and Jan Mayen Islands
1                            Kuwait
2                           Bahrain
3                          Slovenia
4                           Belarus
5                           Austria
6                Russian Federation
7                           Estonia
8                           Ukraine
9                           Morocco
Name: Country Name, dtype: object

**Least countries for last 10 years.**

In [34]:
bottom_10 = df[df['year']>=df['year'].max()-10].groupby('Country Name').sum().sort_values(by='tem_change')[:10].reset_index()['Country Name']
print(bottom_10)

0                      Singapore
1                          Yemen
2    Falkland Islands (Malvinas)
3                           Niue
4                          Nauru
5                  Midway Island
6          Serbia and Montenegro
7                        Burundi
8                         Rwanda
9                        Tokelau
Name: Country Name, dtype: object

**The trend of changing.**

In [35]:
df['tem_change'].mode()

0    0.0
dtype: float64

In [36]:
df['tem_change'].drop(df[df['tem_change'] == 0].index).mode()

0    0.307
dtype: float64